MikroElektronika/core_packages/PIC/XC8/def/PIC18F2680/mcu.h
extern volatile CANSTAT_RO5bits_t CANSTAT_RO5bits __at(0xE6E);
// bitfield macros
#define _CANSTAT_RO5_EICODE0_POSN                           0x0
#define _CANSTAT_RO5_EICODE0_POSITION                       0x0
#define _CANSTAT_RO5_EICODE0_SIZE                           0x1
#define _CANSTAT_RO5_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO5_EICODE0_MASK                           0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO5_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO5_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO5_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO5_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO5_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO5_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO5_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO5_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO5_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO5_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO5_EICODE4_POSN                           0x4
#define _CANSTAT_RO5_EICODE4_POSITION                       0x4
#define _CANSTAT_RO5_EICODE4_SIZE                           0x1
#define _CANSTAT_RO5_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO5_EICODE4_MASK                           0x10
#define _CANSTAT_RO5_OPMODE0_POSN                           0x5
#define _CANSTAT_RO5_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO5_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO5_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO5_OPMODE0_MASK                           0x20
#define _CANSTAT_RO5_OPMODE1_POSN                           0x6
#define _CANSTAT_RO5_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO5_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO5_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO5_OPMODE1_MASK                           0x40
#define _CANSTAT_RO5_OPMODE2_POSN                           0x7
#define _CANSTAT_RO5_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO5_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO5_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO5_OPMODE2_MASK                           0x80
#define _CANSTAT_RO5_ICODE0_POSN                            0x0
#define _CANSTAT_RO5_ICODE0_POSITION                        0x0
#define _CANSTAT_RO5_ICODE0_SIZE                            0x1
#define _CANSTAT_RO5_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO5_ICODE0_MASK                            0x1
#define _CANSTAT_RO5_ICODE1_POSN                            0x1
#define _CANSTAT_RO5_ICODE1_POSITION                        0x1
#define _CANSTAT_RO5_ICODE1_SIZE                            0x1
#define _CANSTAT_RO5_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO5_ICODE1_MASK                            0x2
#define _CANSTAT_RO5_ICODE2_POSN                            0x2
#define _CANSTAT_RO5_ICODE2_POSITION                        0x2
#define _CANSTAT_RO5_ICODE2_SIZE                            0x1
#define _CANSTAT_RO5_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO5_ICODE2_MASK                            0x4
#define _CANSTAT_RO5_ICODE3_POSN                            0x3
#define _CANSTAT_RO5_ICODE3_POSITION                        0x3
#define _CANSTAT_RO5_ICODE3_SIZE                            0x1
#define _CANSTAT_RO5_ICODE3_LENGTH                          0x1
#define _CANSTAT_RO5_ICODE3_MASK                            0x8
#define _CANSTAT_RO5_ICODE4_POSN                            0x4
#define _CANSTAT_RO5_ICODE4_POSITION                        0x4
#define _CANSTAT_RO5_ICODE4_SIZE                            0x1
#define _CANSTAT_RO5_ICODE4_LENGTH                          0x1
#define _CANSTAT_RO5_ICODE4_MASK                            0x10

// Register: CANCON_RO5
#define CANCON_RO5 CANCON_RO5
extern volatile unsigned char           CANCON_RO5          __at(0xE6F);
#ifndef _LIB_BUILD
asm("CANCON_RO5 equ 0E6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP0                 :1;
        unsigned REQOP1                 :1;
        unsigned REQOP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
} CANCON_RO5bits_t;
extern volatile CANCON_RO5bits_t CANCON_RO5bits __at(0xE6F);
// bitfield macros
#define _CANCON_RO5_FP0_POSN                                0x0
#define _CANCON_RO5_FP0_POSITION                            0x0
#define _CANCON_RO5_FP0_SIZE                                0x1
#define _CANCON_RO5_FP0_LENGTH                              0x1
#define _CANCON_RO5_FP0_MASK                                0x1
#define _CANCON_RO5_WIN0_FP1_POSN                           0x1
#define _CANCON_RO5_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO5_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO5_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO5_WIN0_FP1_MASK                           0x2
#define _CANCON_RO5_WIN1_FP2_POSN                           0x2
#define _CANCON_RO5_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO5_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO5_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO5_WIN1_FP2_MASK                           0x4
#define _CANCON_RO5_WIN2_FP3_POSN                           0x3
#define _CANCON_RO5_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO5_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO5_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO5_WIN2_FP3_MASK                           0x8
#define _CANCON_RO5_ABAT_POSN                               0x4
#define _CANCON_RO5_ABAT_POSITION                           0x4
#define _CANCON_RO5_ABAT_SIZE                               0x1
#define _CANCON_RO5_ABAT_LENGTH                             0x1
#define _CANCON_RO5_ABAT_MASK                               0x10
#define _CANCON_RO5_REQOP0_POSN                             0x5
#define _CANCON_RO5_REQOP0_POSITION                         0x5
#define _CANCON_RO5_REQOP0_SIZE                             0x1
#define _CANCON_RO5_REQOP0_LENGTH                           0x1
#define _CANCON_RO5_REQOP0_MASK                             0x20
#define _CANCON_RO5_REQOP1_POSN                             0x6
#define _CANCON_RO5_REQOP1_POSITION                         0x6
#define _CANCON_RO5_REQOP1_SIZE                             0x1
#define _CANCON_RO5_REQOP1_LENGTH                           0x1
#define _CANCON_RO5_REQOP1_MASK                             0x40
#define _CANCON_RO5_REQOP2_POSN                             0x7
#define _CANCON_RO5_REQOP2_POSITION                         0x7
#define _CANCON_RO5_REQOP2_SIZE                             0x1
#define _CANCON_RO5_REQOP2_LENGTH                           0x1
#define _CANCON_RO5_REQOP2_MASK                             0x80
#define _CANCON_RO5_WIN0_POSN                               0x1
#define _CANCON_RO5_WIN0_POSITION                           0x1
#define _CANCON_RO5_WIN0_SIZE                               0x1
#define _CANCON_RO5_WIN0_LENGTH                             0x1
#define _CANCON_RO5_WIN0_MASK                               0x2
#define _CANCON_RO5_WIN1_POSN                               0x2
#define _CANCON_RO5_WIN1_POSITION                           0x2
#define _CANCON_RO5_WIN1_SIZE                               0x1
#define _CANCON_RO5_WIN1_LENGTH                             0x1
#define _CANCON_RO5_WIN1_MASK                               0x4
#define _CANCON_RO5_WIN2_POSN                               0x3
#define _CANCON_RO5_WIN2_POSITION                           0x3
#define _CANCON_RO5_WIN2_SIZE                               0x1
#define _CANCON_RO5_WIN2_LENGTH                             0x1
#define _CANCON_RO5_WIN2_MASK                               0x8

// Register: B5CON
#define B5CON B5CON
extern volatile unsigned char           B5CON               __at(0xE70);
#ifndef _LIB_BUILD
asm("B5CON equ 0E70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0_TXPRI0         :1;
        unsigned FILHIT1_TXPRI1         :1;
        unsigned FILHIT2_RTREN          :1;
        unsigned FILHIT3_TXREQ          :1;
        unsigned FILHIT4_TXERR          :1;
        unsigned RXRTRRO_TXLARB         :1;
        unsigned RXM1_TXABT             :1;
        unsigned RXFUL_TXBIF            :1;
    };
    struct {
        unsigned FILHIT0                :1;
        unsigned FILHIT1                :1;
        unsigned FILHIT2                :1;
        unsigned FILHIT3                :1;
        unsigned FILHIT4                :1;
        unsigned RTRRO                  :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned RTREN                  :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
        unsigned TXBIF                  :1;
    };
    struct {
        unsigned                        :5;
        unsigned RXRTRRO                :1;
    };
    struct {
        unsigned B5FILHIT0              :1;
        unsigned B5FILHIT1              :1;
        unsigned B5FILHIT2              :1;
        unsigned B5FILHIT3              :1;
        unsigned B5FILHIT4              :1;
        unsigned B5RTRRO                :1;
        unsigned B5RXM1                 :1;
        unsigned B5RXFUL                :1;
    };
    struct {
        unsigned B5TXPRI0               :1;
        unsigned B5TXPRI1               :1;
        unsigned B5RTREN                :1;
        unsigned B5TXREQ                :1;
        unsigned B5TXERR                :1;
        unsigned B5TXLARB               :1;
        unsigned B5TXABT                :1;
        unsigned B5TXBIF                :1;
    };
} B5CONbits_t;
