MikroElektronika/core_packages/PIC/XC8/def/PIC18F2680/mcu.h
extern volatile TXB0DLCbits_t TXB0DLCbits __at(0xF45);
// bitfield macros
#define _TXB0DLC_DLC0_POSN                                  0x0
#define _TXB0DLC_DLC0_POSITION                              0x0
#define _TXB0DLC_DLC0_SIZE                                  0x1
#define _TXB0DLC_DLC0_LENGTH                                0x1
#define _TXB0DLC_DLC0_MASK                                  0x1
#define _TXB0DLC_DLC1_POSN                                  0x1
#define _TXB0DLC_DLC1_POSITION                              0x1
#define _TXB0DLC_DLC1_SIZE                                  0x1
#define _TXB0DLC_DLC1_LENGTH                                0x1
#define _TXB0DLC_DLC1_MASK                                  0x2
#define _TXB0DLC_DLC2_POSN                                  0x2
#define _TXB0DLC_DLC2_POSITION                              0x2
#define _TXB0DLC_DLC2_SIZE                                  0x1
#define _TXB0DLC_DLC2_LENGTH                                0x1
#define _TXB0DLC_DLC2_MASK                                  0x4
#define _TXB0DLC_DLC3_POSN                                  0x3
#define _TXB0DLC_DLC3_POSITION                              0x3
#define _TXB0DLC_DLC3_SIZE                                  0x1
#define _TXB0DLC_DLC3_LENGTH                                0x1
#define _TXB0DLC_DLC3_MASK                                  0x8
#define _TXB0DLC_TXRTR_POSN                                 0x6
#define _TXB0DLC_TXRTR_POSITION                             0x6
#define _TXB0DLC_TXRTR_SIZE                                 0x1
#define _TXB0DLC_TXRTR_LENGTH                               0x1
#define _TXB0DLC_TXRTR_MASK                                 0x40
#define _TXB0DLC_TXB0DLC0_POSN                              0x0
#define _TXB0DLC_TXB0DLC0_POSITION                          0x0
#define _TXB0DLC_TXB0DLC0_SIZE                              0x1
#define _TXB0DLC_TXB0DLC0_LENGTH                            0x1
#define _TXB0DLC_TXB0DLC0_MASK                              0x1
#define _TXB0DLC_TXB0DLC1_POSN                              0x1
#define _TXB0DLC_TXB0DLC1_POSITION                          0x1
#define _TXB0DLC_TXB0DLC1_SIZE                              0x1
#define _TXB0DLC_TXB0DLC1_LENGTH                            0x1
#define _TXB0DLC_TXB0DLC1_MASK                              0x2
#define _TXB0DLC_TXB0DLC2_POSN                              0x2
#define _TXB0DLC_TXB0DLC2_POSITION                          0x2
#define _TXB0DLC_TXB0DLC2_SIZE                              0x1
#define _TXB0DLC_TXB0DLC2_LENGTH                            0x1
#define _TXB0DLC_TXB0DLC2_MASK                              0x4
#define _TXB0DLC_TXB0DLC3_POSN                              0x3
#define _TXB0DLC_TXB0DLC3_POSITION                          0x3
#define _TXB0DLC_TXB0DLC3_SIZE                              0x1
#define _TXB0DLC_TXB0DLC3_LENGTH                            0x1
#define _TXB0DLC_TXB0DLC3_MASK                              0x8
#define _TXB0DLC_TXB0RTR_POSN                               0x6
#define _TXB0DLC_TXB0RTR_POSITION                           0x6
#define _TXB0DLC_TXB0RTR_SIZE                               0x1
#define _TXB0DLC_TXB0RTR_LENGTH                             0x1
#define _TXB0DLC_TXB0RTR_MASK                               0x40

// Register: TXB0D0
#define TXB0D0 TXB0D0
extern volatile unsigned char           TXB0D0              __at(0xF46);
#ifndef _LIB_BUILD
asm("TXB0D0 equ 0F46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB0D00                :1;
        unsigned TXB0D01                :1;
        unsigned TXB0D02                :1;
        unsigned TXB0D03                :1;
        unsigned TXB0D04                :1;
        unsigned TXB0D05                :1;
        unsigned TXB0D06                :1;
        unsigned TXB0D07                :1;
    };
} TXB0D0bits_t;
extern volatile TXB0D0bits_t TXB0D0bits __at(0xF46);
// bitfield macros
#define _TXB0D0_TXB0D00_POSN                                0x0
#define _TXB0D0_TXB0D00_POSITION                            0x0
#define _TXB0D0_TXB0D00_SIZE                                0x1
#define _TXB0D0_TXB0D00_LENGTH                              0x1
#define _TXB0D0_TXB0D00_MASK                                0x1
#define _TXB0D0_TXB0D01_POSN                                0x1
#define _TXB0D0_TXB0D01_POSITION                            0x1
#define _TXB0D0_TXB0D01_SIZE                                0x1
#define _TXB0D0_TXB0D01_LENGTH                              0x1
#define _TXB0D0_TXB0D01_MASK                                0x2
#define _TXB0D0_TXB0D02_POSN                                0x2
#define _TXB0D0_TXB0D02_POSITION                            0x2
#define _TXB0D0_TXB0D02_SIZE                                0x1
#define _TXB0D0_TXB0D02_LENGTH                              0x1
#define _TXB0D0_TXB0D02_MASK                                0x4
#define _TXB0D0_TXB0D03_POSN                                0x3
#define _TXB0D0_TXB0D03_POSITION                            0x3
#define _TXB0D0_TXB0D03_SIZE                                0x1
#define _TXB0D0_TXB0D03_LENGTH                              0x1
#define _TXB0D0_TXB0D03_MASK                                0x8
#define _TXB0D0_TXB0D04_POSN                                0x4
#define _TXB0D0_TXB0D04_POSITION                            0x4
#define _TXB0D0_TXB0D04_SIZE                                0x1
#define _TXB0D0_TXB0D04_LENGTH                              0x1
#define _TXB0D0_TXB0D04_MASK                                0x10
#define _TXB0D0_TXB0D05_POSN                                0x5
#define _TXB0D0_TXB0D05_POSITION                            0x5
#define _TXB0D0_TXB0D05_SIZE                                0x1
#define _TXB0D0_TXB0D05_LENGTH                              0x1
#define _TXB0D0_TXB0D05_MASK                                0x20
#define _TXB0D0_TXB0D06_POSN                                0x6
#define _TXB0D0_TXB0D06_POSITION                            0x6
#define _TXB0D0_TXB0D06_SIZE                                0x1
#define _TXB0D0_TXB0D06_LENGTH                              0x1
#define _TXB0D0_TXB0D06_MASK                                0x40
#define _TXB0D0_TXB0D07_POSN                                0x7
#define _TXB0D0_TXB0D07_POSITION                            0x7
#define _TXB0D0_TXB0D07_SIZE                                0x1
#define _TXB0D0_TXB0D07_LENGTH                              0x1
#define _TXB0D0_TXB0D07_MASK                                0x80

// Register: TXB0D1
#define TXB0D1 TXB0D1
extern volatile unsigned char           TXB0D1              __at(0xF47);
#ifndef _LIB_BUILD
asm("TXB0D1 equ 0F47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB0D10                :1;
        unsigned TXB0D11                :1;
        unsigned TXB0D12                :1;
        unsigned TXB0D13                :1;
        unsigned TXB0D14                :1;
        unsigned TXB0D15                :1;
        unsigned TXB0D16                :1;
        unsigned TXB0D17                :1;
    };
} TXB0D1bits_t;
