MikroElektronika/core_packages/PIC/XC8/def/PIC18F2680/mcu.h
extern volatile RXB1CONbits_t RXB1CONbits __at(0xF50);
// bitfield macros
#define _RXB1CON_FILHIT0_POSN                               0x0
#define _RXB1CON_FILHIT0_POSITION                           0x0
#define _RXB1CON_FILHIT0_SIZE                               0x1
#define _RXB1CON_FILHIT0_LENGTH                             0x1
#define _RXB1CON_FILHIT0_MASK                               0x1
#define _RXB1CON_FILHIT1_POSN                               0x1
#define _RXB1CON_FILHIT1_POSITION                           0x1
#define _RXB1CON_FILHIT1_SIZE                               0x1
#define _RXB1CON_FILHIT1_LENGTH                             0x1
#define _RXB1CON_FILHIT1_MASK                               0x2
#define _RXB1CON_FILHIT2_POSN                               0x2
#define _RXB1CON_FILHIT2_POSITION                           0x2
#define _RXB1CON_FILHIT2_SIZE                               0x1
#define _RXB1CON_FILHIT2_LENGTH                             0x1
#define _RXB1CON_FILHIT2_MASK                               0x4
#define _RXB1CON_RXRTRRO_FILHIT3_POSN                       0x3
#define _RXB1CON_RXRTRRO_FILHIT3_POSITION                   0x3
#define _RXB1CON_RXRTRRO_FILHIT3_SIZE                       0x1
#define _RXB1CON_RXRTRRO_FILHIT3_LENGTH                     0x1
#define _RXB1CON_RXRTRRO_FILHIT3_MASK                       0x8
#define _RXB1CON_FILHIT4_POSN                               0x4
#define _RXB1CON_FILHIT4_POSITION                           0x4
#define _RXB1CON_FILHIT4_SIZE                               0x1
#define _RXB1CON_FILHIT4_LENGTH                             0x1
#define _RXB1CON_FILHIT4_MASK                               0x10
#define _RXB1CON_RXM0_RTRRO_POSN                            0x5
#define _RXB1CON_RXM0_RTRRO_POSITION                        0x5
#define _RXB1CON_RXM0_RTRRO_SIZE                            0x1
#define _RXB1CON_RXM0_RTRRO_LENGTH                          0x1
#define _RXB1CON_RXM0_RTRRO_MASK                            0x20
#define _RXB1CON_RXM1_POSN                                  0x6
#define _RXB1CON_RXM1_POSITION                              0x6
#define _RXB1CON_RXM1_SIZE                                  0x1
#define _RXB1CON_RXM1_LENGTH                                0x1
#define _RXB1CON_RXM1_MASK                                  0x40
#define _RXB1CON_RXFUL_POSN                                 0x7
#define _RXB1CON_RXFUL_POSITION                             0x7
#define _RXB1CON_RXFUL_SIZE                                 0x1
#define _RXB1CON_RXFUL_LENGTH                               0x1
#define _RXB1CON_RXFUL_MASK                                 0x80
#define _RXB1CON_RXRTRRO_POSN                               0x3
#define _RXB1CON_RXRTRRO_POSITION                           0x3
#define _RXB1CON_RXRTRRO_SIZE                               0x1
#define _RXB1CON_RXRTRRO_LENGTH                             0x1
#define _RXB1CON_RXRTRRO_MASK                               0x8
#define _RXB1CON_RXM0_POSN                                  0x5
#define _RXB1CON_RXM0_POSITION                              0x5
#define _RXB1CON_RXM0_SIZE                                  0x1
#define _RXB1CON_RXM0_LENGTH                                0x1
#define _RXB1CON_RXM0_MASK                                  0x20
#define _RXB1CON_FILHIT3_POSN                               0x3
#define _RXB1CON_FILHIT3_POSITION                           0x3
#define _RXB1CON_FILHIT3_SIZE                               0x1
#define _RXB1CON_FILHIT3_LENGTH                             0x1
#define _RXB1CON_FILHIT3_MASK                               0x8
#define _RXB1CON_RTRRO_POSN                                 0x5
#define _RXB1CON_RTRRO_POSITION                             0x5
#define _RXB1CON_RTRRO_SIZE                                 0x1
#define _RXB1CON_RTRRO_LENGTH                               0x1
#define _RXB1CON_RTRRO_MASK                                 0x20
#define _RXB1CON_RXB1FILHIT0_POSN                           0x0
#define _RXB1CON_RXB1FILHIT0_POSITION                       0x0
#define _RXB1CON_RXB1FILHIT0_SIZE                           0x1
#define _RXB1CON_RXB1FILHIT0_LENGTH                         0x1
#define _RXB1CON_RXB1FILHIT0_MASK                           0x1
#define _RXB1CON_RXB1FILHIT1_POSN                           0x1
#define _RXB1CON_RXB1FILHIT1_POSITION                       0x1
#define _RXB1CON_RXB1FILHIT1_SIZE                           0x1
#define _RXB1CON_RXB1FILHIT1_LENGTH                         0x1
#define _RXB1CON_RXB1FILHIT1_MASK                           0x2
#define _RXB1CON_RXB1FILHIT2_POSN                           0x2
#define _RXB1CON_RXB1FILHIT2_POSITION                       0x2
#define _RXB1CON_RXB1FILHIT2_SIZE                           0x1
#define _RXB1CON_RXB1FILHIT2_LENGTH                         0x1
#define _RXB1CON_RXB1FILHIT2_MASK                           0x4
#define _RXB1CON_RXB1FILHIT3_POSN                           0x3
#define _RXB1CON_RXB1FILHIT3_POSITION                       0x3
#define _RXB1CON_RXB1FILHIT3_SIZE                           0x1
#define _RXB1CON_RXB1FILHIT3_LENGTH                         0x1
#define _RXB1CON_RXB1FILHIT3_MASK                           0x8
#define _RXB1CON_RXB1FILHIT4_POSN                           0x4
#define _RXB1CON_RXB1FILHIT4_POSITION                       0x4
#define _RXB1CON_RXB1FILHIT4_SIZE                           0x1
#define _RXB1CON_RXB1FILHIT4_LENGTH                         0x1
#define _RXB1CON_RXB1FILHIT4_MASK                           0x10
#define _RXB1CON_RXB1M0_POSN                                0x5
#define _RXB1CON_RXB1M0_POSITION                            0x5
#define _RXB1CON_RXB1M0_SIZE                                0x1
#define _RXB1CON_RXB1M0_LENGTH                              0x1
#define _RXB1CON_RXB1M0_MASK                                0x20
#define _RXB1CON_RXB1M1_POSN                                0x6
#define _RXB1CON_RXB1M1_POSITION                            0x6
#define _RXB1CON_RXB1M1_SIZE                                0x1
#define _RXB1CON_RXB1M1_LENGTH                              0x1
#define _RXB1CON_RXB1M1_MASK                                0x40
#define _RXB1CON_RXB1FUL_POSN                               0x7
#define _RXB1CON_RXB1FUL_POSITION                           0x7
#define _RXB1CON_RXB1FUL_SIZE                               0x1
#define _RXB1CON_RXB1FUL_LENGTH                             0x1
#define _RXB1CON_RXB1FUL_MASK                               0x80
#define _RXB1CON_RXB1RTRR0_POSN                             0x3
#define _RXB1CON_RXB1RTRR0_POSITION                         0x3
#define _RXB1CON_RXB1RTRR0_SIZE                             0x1
#define _RXB1CON_RXB1RTRR0_LENGTH                           0x1
#define _RXB1CON_RXB1RTRR0_MASK                             0x8
#define _RXB1CON_RXB1RTRRO_POSN                             0x5
#define _RXB1CON_RXB1RTRRO_POSITION                         0x5
#define _RXB1CON_RXB1RTRRO_SIZE                             0x1
#define _RXB1CON_RXB1RTRRO_LENGTH                           0x1
#define _RXB1CON_RXB1RTRRO_MASK                             0x20

// Register: RXB1SIDH
#define RXB1SIDH RXB1SIDH
extern volatile unsigned char           RXB1SIDH            __at(0xF51);
#ifndef _LIB_BUILD
asm("RXB1SIDH equ 0F51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXB1SID3               :1;
        unsigned RXB1SID4               :1;
        unsigned RXB1SID5               :1;
        unsigned RXB1SID6               :1;
        unsigned RXB1SID7               :1;
        unsigned RXB1SID8               :1;
        unsigned RXB1SID9               :1;
        unsigned RXB1SID10              :1;
    };
} RXB1SIDHbits_t;
extern volatile RXB1SIDHbits_t RXB1SIDHbits __at(0xF51);
// bitfield macros
#define _RXB1SIDH_SID3_POSN                                 0x0
#define _RXB1SIDH_SID3_POSITION                             0x0
#define _RXB1SIDH_SID3_SIZE                                 0x1
#define _RXB1SIDH_SID3_LENGTH                               0x1
#define _RXB1SIDH_SID3_MASK                                 0x1
#define _RXB1SIDH_SID4_POSN                                 0x1
#define _RXB1SIDH_SID4_POSITION                             0x1
#define _RXB1SIDH_SID4_SIZE                                 0x1
#define _RXB1SIDH_SID4_LENGTH                               0x1
#define _RXB1SIDH_SID4_MASK                                 0x2
#define _RXB1SIDH_SID5_POSN                                 0x2
#define _RXB1SIDH_SID5_POSITION                             0x2
#define _RXB1SIDH_SID5_SIZE                                 0x1
#define _RXB1SIDH_SID5_LENGTH                               0x1
#define _RXB1SIDH_SID5_MASK                                 0x4
#define _RXB1SIDH_SID6_POSN                                 0x3
#define _RXB1SIDH_SID6_POSITION                             0x3
#define _RXB1SIDH_SID6_SIZE                                 0x1
#define _RXB1SIDH_SID6_LENGTH                               0x1
#define _RXB1SIDH_SID6_MASK                                 0x8
#define _RXB1SIDH_SID7_POSN                                 0x4
#define _RXB1SIDH_SID7_POSITION                             0x4
#define _RXB1SIDH_SID7_SIZE                                 0x1
#define _RXB1SIDH_SID7_LENGTH                               0x1
#define _RXB1SIDH_SID7_MASK                                 0x10
#define _RXB1SIDH_SID8_POSN                                 0x5
#define _RXB1SIDH_SID8_POSITION                             0x5
#define _RXB1SIDH_SID8_SIZE                                 0x1
#define _RXB1SIDH_SID8_LENGTH                               0x1
#define _RXB1SIDH_SID8_MASK                                 0x20
#define _RXB1SIDH_SID9_POSN                                 0x6
#define _RXB1SIDH_SID9_POSITION                             0x6
#define _RXB1SIDH_SID9_SIZE                                 0x1
#define _RXB1SIDH_SID9_LENGTH                               0x1
#define _RXB1SIDH_SID9_MASK                                 0x40
#define _RXB1SIDH_SID10_POSN                                0x7
#define _RXB1SIDH_SID10_POSITION                            0x7
#define _RXB1SIDH_SID10_SIZE                                0x1
#define _RXB1SIDH_SID10_LENGTH                              0x1
#define _RXB1SIDH_SID10_MASK                                0x80
#define _RXB1SIDH_RXB1SID3_POSN                             0x0
#define _RXB1SIDH_RXB1SID3_POSITION                         0x0
#define _RXB1SIDH_RXB1SID3_SIZE                             0x1
#define _RXB1SIDH_RXB1SID3_LENGTH                           0x1
#define _RXB1SIDH_RXB1SID3_MASK                             0x1
#define _RXB1SIDH_RXB1SID4_POSN                             0x1
#define _RXB1SIDH_RXB1SID4_POSITION                         0x1
#define _RXB1SIDH_RXB1SID4_SIZE                             0x1
#define _RXB1SIDH_RXB1SID4_LENGTH                           0x1
#define _RXB1SIDH_RXB1SID4_MASK                             0x2
#define _RXB1SIDH_RXB1SID5_POSN                             0x2
#define _RXB1SIDH_RXB1SID5_POSITION                         0x2
#define _RXB1SIDH_RXB1SID5_SIZE                             0x1
#define _RXB1SIDH_RXB1SID5_LENGTH                           0x1
#define _RXB1SIDH_RXB1SID5_MASK                             0x4
#define _RXB1SIDH_RXB1SID6_POSN                             0x3
#define _RXB1SIDH_RXB1SID6_POSITION                         0x3
#define _RXB1SIDH_RXB1SID6_SIZE                             0x1
#define _RXB1SIDH_RXB1SID6_LENGTH                           0x1
#define _RXB1SIDH_RXB1SID6_MASK                             0x8
#define _RXB1SIDH_RXB1SID7_POSN                             0x4
#define _RXB1SIDH_RXB1SID7_POSITION                         0x4
#define _RXB1SIDH_RXB1SID7_SIZE                             0x1
#define _RXB1SIDH_RXB1SID7_LENGTH                           0x1
#define _RXB1SIDH_RXB1SID7_MASK                             0x10
#define _RXB1SIDH_RXB1SID8_POSN                             0x5
#define _RXB1SIDH_RXB1SID8_POSITION                         0x5
#define _RXB1SIDH_RXB1SID8_SIZE                             0x1
#define _RXB1SIDH_RXB1SID8_LENGTH                           0x1
#define _RXB1SIDH_RXB1SID8_MASK                             0x20
#define _RXB1SIDH_RXB1SID9_POSN                             0x6
#define _RXB1SIDH_RXB1SID9_POSITION                         0x6
#define _RXB1SIDH_RXB1SID9_SIZE                             0x1
#define _RXB1SIDH_RXB1SID9_LENGTH                           0x1
#define _RXB1SIDH_RXB1SID9_MASK                             0x40
#define _RXB1SIDH_RXB1SID10_POSN                            0x7
#define _RXB1SIDH_RXB1SID10_POSITION                        0x7
#define _RXB1SIDH_RXB1SID10_SIZE                            0x1
#define _RXB1SIDH_RXB1SID10_LENGTH                          0x1
#define _RXB1SIDH_RXB1SID10_MASK                            0x80

// Register: RXB1SIDL
#define RXB1SIDL RXB1SIDL
extern volatile unsigned char           RXB1SIDL            __at(0xF52);
#ifndef _LIB_BUILD
asm("RXB1SIDL equ 0F52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXID                   :1;
        unsigned SRR                    :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXB1EID16              :1;
        unsigned RXB1EID17              :1;
        unsigned                        :1;
        unsigned RXB1EXID               :1;
        unsigned RXB1SRR                :1;
        unsigned RXB1SID0               :1;
        unsigned RXB1SID1               :1;
        unsigned RXB1SID2               :1;
    };
} RXB1SIDLbits_t;
extern volatile RXB1SIDLbits_t RXB1SIDLbits __at(0xF52);
// bitfield macros
#define _RXB1SIDL_EID16_POSN                                0x0
#define _RXB1SIDL_EID16_POSITION                            0x0
#define _RXB1SIDL_EID16_SIZE                                0x1
#define _RXB1SIDL_EID16_LENGTH                              0x1
#define _RXB1SIDL_EID16_MASK                                0x1
#define _RXB1SIDL_EID17_POSN                                0x1
#define _RXB1SIDL_EID17_POSITION                            0x1
#define _RXB1SIDL_EID17_SIZE                                0x1
#define _RXB1SIDL_EID17_LENGTH                              0x1
#define _RXB1SIDL_EID17_MASK                                0x2
#define _RXB1SIDL_EXID_POSN                                 0x3
#define _RXB1SIDL_EXID_POSITION                             0x3
#define _RXB1SIDL_EXID_SIZE                                 0x1
#define _RXB1SIDL_EXID_LENGTH                               0x1
#define _RXB1SIDL_EXID_MASK                                 0x8
#define _RXB1SIDL_SRR_POSN                                  0x4
#define _RXB1SIDL_SRR_POSITION                              0x4
#define _RXB1SIDL_SRR_SIZE                                  0x1
#define _RXB1SIDL_SRR_LENGTH                                0x1
#define _RXB1SIDL_SRR_MASK                                  0x10
#define _RXB1SIDL_SID0_POSN                                 0x5
#define _RXB1SIDL_SID0_POSITION                             0x5
#define _RXB1SIDL_SID0_SIZE                                 0x1
#define _RXB1SIDL_SID0_LENGTH                               0x1
#define _RXB1SIDL_SID0_MASK                                 0x20
#define _RXB1SIDL_SID1_POSN                                 0x6
#define _RXB1SIDL_SID1_POSITION                             0x6
#define _RXB1SIDL_SID1_SIZE                                 0x1
#define _RXB1SIDL_SID1_LENGTH                               0x1
#define _RXB1SIDL_SID1_MASK                                 0x40
#define _RXB1SIDL_SID2_POSN                                 0x7
#define _RXB1SIDL_SID2_POSITION                             0x7
#define _RXB1SIDL_SID2_SIZE                                 0x1
#define _RXB1SIDL_SID2_LENGTH                               0x1
#define _RXB1SIDL_SID2_MASK                                 0x80
#define _RXB1SIDL_RXB1EID16_POSN                            0x0
#define _RXB1SIDL_RXB1EID16_POSITION                        0x0
#define _RXB1SIDL_RXB1EID16_SIZE                            0x1
#define _RXB1SIDL_RXB1EID16_LENGTH                          0x1
#define _RXB1SIDL_RXB1EID16_MASK                            0x1
#define _RXB1SIDL_RXB1EID17_POSN                            0x1
#define _RXB1SIDL_RXB1EID17_POSITION                        0x1
#define _RXB1SIDL_RXB1EID17_SIZE                            0x1
#define _RXB1SIDL_RXB1EID17_LENGTH                          0x1
#define _RXB1SIDL_RXB1EID17_MASK                            0x2
#define _RXB1SIDL_RXB1EXID_POSN                             0x3
#define _RXB1SIDL_RXB1EXID_POSITION                         0x3
#define _RXB1SIDL_RXB1EXID_SIZE                             0x1
#define _RXB1SIDL_RXB1EXID_LENGTH                           0x1
#define _RXB1SIDL_RXB1EXID_MASK                             0x8
#define _RXB1SIDL_RXB1SRR_POSN                              0x4
#define _RXB1SIDL_RXB1SRR_POSITION                          0x4
#define _RXB1SIDL_RXB1SRR_SIZE                              0x1
#define _RXB1SIDL_RXB1SRR_LENGTH                            0x1
#define _RXB1SIDL_RXB1SRR_MASK                              0x10
#define _RXB1SIDL_RXB1SID0_POSN                             0x5
#define _RXB1SIDL_RXB1SID0_POSITION                         0x5
#define _RXB1SIDL_RXB1SID0_SIZE                             0x1
#define _RXB1SIDL_RXB1SID0_LENGTH                           0x1
#define _RXB1SIDL_RXB1SID0_MASK                             0x20
#define _RXB1SIDL_RXB1SID1_POSN                             0x6
#define _RXB1SIDL_RXB1SID1_POSITION                         0x6
#define _RXB1SIDL_RXB1SID1_SIZE                             0x1
#define _RXB1SIDL_RXB1SID1_LENGTH                           0x1
#define _RXB1SIDL_RXB1SID1_MASK                             0x40
#define _RXB1SIDL_RXB1SID2_POSN                             0x7
#define _RXB1SIDL_RXB1SID2_POSITION                         0x7
#define _RXB1SIDL_RXB1SID2_SIZE                             0x1
#define _RXB1SIDL_RXB1SID2_LENGTH                           0x1
#define _RXB1SIDL_RXB1SID2_MASK                             0x80

// Register: RXB1EIDH
#define RXB1EIDH RXB1EIDH
extern volatile unsigned char           RXB1EIDH            __at(0xF53);
#ifndef _LIB_BUILD
asm("RXB1EIDH equ 0F53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXB1EID8               :1;
        unsigned RXB1EID9               :1;
        unsigned RXB1EID10              :1;
        unsigned RXB1EID11              :1;
        unsigned RXB1EID12              :1;
        unsigned RXB1EID13              :1;
        unsigned RXB1EID14              :1;
        unsigned RXB1EID15              :1;
    };
} RXB1EIDHbits_t;
